Catalogs/ОпросыПоКомпетенциям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОпросыПоКомпетенциям</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДолжности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполненияЭкспертов</Name>
					<Comment>АПК:58 Различия имени и синонима оправданы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособЗаполненияРеспондентовВОценке360</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтактнойИнформацииОценивающиеЭксперты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОткрытыеВопросы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулировкаРазделаОткрытыхВопросов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Оцениваемые</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеОпроса</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценивающиеЭкспертыЕдиныйНабор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОценивающийЭксперт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОценивающийЭксперт</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольЭксперта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОценивающиеЭксперты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценивающийЭксперт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОценивающийЭксперт</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольЭксперта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиРеспондентаОценкиПерсонала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОткрытыеВопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЭкспертнаяОценкаПерсоналаСобытия/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Процедура-обработчик события "ПриЗаписи" регистра сведений РегистрСведений.ОтветыНаВопросыАнкет.
//
// Параметры:
//	НаборЗаписейРегистра	- РегистрСведенийНаборЗаписей - источник события.
//	Отказ					- Булево - флаг отказа от выполнения обработчика.
//	Замещение				- Булево - флаг замещения записей при записи.
Процедура ПересчитатьОценкиПоОпросу(НаборЗаписейРегистра, Отказ, Замещение) Экспорт

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(НаборЗаписейРегистра) Тогда
		Возврат;
	КонецЕсли;
	
	Анкеты = РегистрыБЗК.ЗначенияОтбораЗаписейНабора(НаборЗаписейРегистра, Замещение, "Регистратор");
	Если Анкеты.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Анкеты[0], "Опрос") Тогда
		Возврат;
	КонецЕсли;
	
	Опросы = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Анкеты, "Опрос");
	Для Каждого Анкета Из Анкеты Цикл
		Опрос = Опросы[Анкета];
		Если Не ЗначениеЗаполнено(Опрос) Тогда
			Продолжить;
		КонецЕсли;
		
		СписокОпросов = СписокОпросовПоНазначению(Опрос);
		Для Каждого Опрос Из СписокОпросов Цикл
			Удаление = НаборЗаписейРегистра.Количество() = 0;
			ЭкспертнаяОценкаПерсонала.РассчитатьОценкиПоОтветам(Опрос, Анкета, Удаление);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик подписки на событие УстановитьИспользованиеЭкспертнойОценкиПерсонала
//
// Параметры:
//  Источник   - КонстантаМенеджерЗначения.ИспользоватьАнкетирование, КонстантаМенеджерЗначения.ИспользоватьШаблоныСообщений - источник события.
//  Отказ      - Булево - параметр, передаваемый в подписку на событие ПриЗаписи.
//
Процедура УстановитьИспользованиеЭкспертнойОценкиПерсоналаПриЗаписи(Источник, Отказ) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.Значение Тогда
		Возврат;
	КонецЕсли;

	Если Константы.ИспользоватьЭкспертнуюОценкуПерсонала.Получить() Тогда
		Константы.ИспользоватьЭкспертнуюОценкуПерсонала.Установить(Ложь);
		
		Если ТипЗнч(Источник) = Тип("КонстантаМенеджерЗначения.ИспользоватьАнкетирование") Тогда
			НаименованиеИсточникаРодительныйПадеж = НСтр("ru = 'Анкетирования'");
		ИначеЕсли ТипЗнч(Источник) = Тип("КонстантаМенеджерЗначения.ИспользоватьШаблоныСообщений") Тогда
			НаименованиеИсточникаРодительныйПадеж = НСтр("ru = 'Шаблонов сообщений'");
		Иначе
			НаименованиеИсточникаРодительныйПадеж = "";
		КонецЕсли;
		
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Использование Экспертной оценки персонала невозможно без использования %1. Экспертная оценка так же была выключена.'"),
			НаименованиеИсточникаРодительныйПадеж);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция СписокОпросовПоНазначению(НазначениеОпроса)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОпросыПоКомпетенциямОцениваемые.Ссылка КАК Опрос
		|ИЗ
		|	Справочник.ОпросыПоКомпетенциям.Оцениваемые КАК ОпросыПоКомпетенциямОцениваемые
		|ГДЕ
		|	ОпросыПоКомпетенциямОцениваемые.НазначениеОпроса = &НазначениеОпроса";
	Запрос.УстановитьПараметр("НазначениеОпроса", НазначениеОпроса);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Опрос");
	
КонецФункции

#КонецОбласти
